#include <8052.h>
#include "util.h"

void main(void)
{
  while(1){

    if(P3_0 == 0){  // 按下 1 号按键, 在第一个数码管显示 1
      P2_2 = 1;
      P2_3 = 1;
      P2_4 = 1;
      P0 = 0x5B; //对应 0101 1011
    }
    if (P3_1 == 0)
    { // 按下 2 号按键, 数码管显示 2
      P2_2 = 1;
      P2_3 = 1;
      P2_4 = 1;
      P0 = 0x06; //对应 0000 0110
    }
    if(P3_2 == 0){  // 按下 3 号按键, 数码管显示 3
      P2_2 = 1;
      P2_3 = 1;
      P2_4 = 1;
      P0 = 0x4F; //对应 0100 1111
    }
    if (P3_3 == 0)
    { // 按下 4 号按键, 数码管显示 4
      P2_2 = 1;
      P2_3 = 1;
      P2_4 = 1;
      P0 = 0x66; //对应 0110 0110
    }
  }
}